{
    "id": "3",
    "title": "Lab 3 Post - Audio for Multimedia",
    "body": "<p>Audio is a very important part of multimedia presentations. Sound precieves the way we consume content,it can make us very emotional, or gives us context information about the situation. Lets dicuss a few of the ways that audio is used in multimedia. </p><h4>Audio for Movies</h4><p>Many people have watched movies or shows, and should know that audio is an important part to set the mood. In a movie, let's say a friend of the main character just died:<br>What do you think when this plays? <br><audio controls> <source src='assets/audio/sad.mp3' type='audio/mpeg'></audio><br>Now how about when this audio plays instead? <br><audio controls> <source src='assets/audio/circus.mp3' type='audio/mpeg'></audio><br>What kind of movie do you think the first movie was vs the second movie? The first audio clip was sad, so you would expect it to be a sad scene. However, the second audio clip playedcircus music. We can infer that the situation isn't serious, perhaps theres a joke scene or its a funny horror movie.Music provides a lot of context about the situation and what is happening. It sets up what people should expect from certain scenes as well as decide what the movie will be about. </p><h4>Audio for Games</h4><p>If you've ever played vidoe games, you know that audio is one of the most important parts of the game. In shooters like valorant, hearing footsteps could determine whether you win or lose. In more story-based games, they influence your emotions based on what your hearing. Like in a horror game, its quiet and then suddenly you start hearing your own heartbeat. In that context its going to make you anxious and afraid which helps you to enjoy what the game is all about, horror. </p><h4>Audio for the Web</h4><p>Audio has a special role in web development, its vital to provide information. There may be users that are visually impaired who rely on sound to understand the content. The visually impaired may use a screen reader which basically reads out whatever's on the screen. This is where proper web structure and heading comes in, we must properly label the content with tags that define what every element is for in order for the screen reader to convey the information to the visually impaired user.</p><h5>To Conclude...</h5><p>Overall, audio is a very important part of multimedia because it sets up so much of the context. Audio plays a crucial role of delivering information to the viewer so that they can understand what is happening. </p>",
    "date": "2023-02-23",
    "image": "", 
    "author": "Jacky Shen"
}